01. RESERVA_VUELO_SOAP_JAVA/02. CLIESC/vuelos_escritorio/xml-resources/web-service-references/WSVuelo/wsdl/10.40.26.45_8080/Reservas_vuelos/WSVuelo.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by XML-WS Runtime (https://github.com/eclipse-ee4j/metro-jax-ws). Runtime's version is Eclipse Metro/4.0.3.payara-p1 (metro-4.0.3.payara-maintenance-004e4e3; 2023-11-08T12:59:53+0000) XMLWS-Impl/4.0.2 XMLWS-API/4.0.1 XMLB-Impl/4.0.4 XMLB-API/4.0.1 git-revision#004e4e3. --><!-- Generated by XML-WS Runtime (https://github.com/eclipse-ee4j/metro-jax-ws). Runtime's version is Eclipse Metro/4.0.3.payara-p1 (metro-4.0.3.payara-maintenance-004e4e3; 2023-11-08T12:59:53+0000) XMLWS-Impl/4.0.2 XMLWS-API/4.0.1 XMLB-Impl/4.0.4 XMLB-API/4.0.1 git-revision#004e4e3. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://controller.monster.edu.ec/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://controller.monster.edu.ec/" name="WSVuelo">
<types>
<xsd:schema>
<xsd:import namespace="http://controller.monster.edu.ec/" schemaLocation="http://10.40.26.45:8080/Reservas_vuelos/WSVuelo?xsd=1"/>
</xsd:schema>
</types>
<<<<<<< HEAD:01. RESERVA_VUELO_SOAP_JAVA/02. CLIESC/vuelos_escritorio/xml-resources/web-service-references/WSVuelo/wsdl/10.40.26.45_8080/Reservas_vuelos/WSVuelo.wsdl
=======
<message name="buscarVuelos">
<part name="parameters" element="tns:buscarVuelos"/>
</message>
<message name="buscarVuelosResponse">
<part name="parameters" element="tns:buscarVuelosResponse"/>
</message>
<message name="comprarBoletos">
<part name="parameters" element="tns:comprarBoletos"/>
</message>
<message name="comprarBoletosResponse">
<part name="parameters" element="tns:comprarBoletosResponse"/>
</message>
<message name="mostrarTodosVuelos">
<part name="parameters" element="tns:mostrarTodosVuelos"/>
</message>
<message name="mostrarTodosVuelosResponse">
<part name="parameters" element="tns:mostrarTodosVuelosResponse"/>
</message>
<message name="registrarUsuario">
<part name="parameters" element="tns:registrarUsuario"/>
</message>
<message name="registrarUsuarioResponse">
<part name="parameters" element="tns:registrarUsuarioResponse"/>
</message>
<message name="mostrarBoletosUsuario">
<part name="parameters" element="tns:mostrarBoletosUsuario"/>
</message>
<message name="mostrarBoletosUsuarioResponse">
<part name="parameters" element="tns:mostrarBoletosUsuarioResponse"/>
</message>
<message name="obtenerIdUsuarioPorEmail">
<part name="parameters" element="tns:obtenerIdUsuarioPorEmail"/>
</message>
<message name="obtenerIdUsuarioPorEmailResponse">
<part name="parameters" element="tns:obtenerIdUsuarioPorEmailResponse"/>
</message>
>>>>>>> 47a79e34fec662558b14e38ab589974b0a06d8e4:01. RESERVA_VUELO_SOAP_JAVA/02. CLICON/vuelos_consola/src/META-INF/wsdl/192.168.0.102_8080/Reservas_vuelos/WSVuelo.wsdl
<message name="login">
<part name="parameters" element="tns:login"/>
</message>
<message name="loginResponse">
<part name="parameters" element="tns:loginResponse"/>
</message>
<<<<<<< HEAD:01. RESERVA_VUELO_SOAP_JAVA/02. CLIESC/vuelos_escritorio/xml-resources/web-service-references/WSVuelo/wsdl/10.40.26.45_8080/Reservas_vuelos/WSVuelo.wsdl
<message name="buscarVuelos">
<part name="parameters" element="tns:buscarVuelos"/>
</message>
<message name="buscarVuelosResponse">
<part name="parameters" element="tns:buscarVuelosResponse"/>
</message>
<message name="comprarBoletos">
<part name="parameters" element="tns:comprarBoletos"/>
</message>
<message name="comprarBoletosResponse">
<part name="parameters" element="tns:comprarBoletosResponse"/>
</message>
<message name="mostrarTodosVuelos">
<part name="parameters" element="tns:mostrarTodosVuelos"/>
</message>
<message name="mostrarTodosVuelosResponse">
<part name="parameters" element="tns:mostrarTodosVuelosResponse"/>
</message>
<message name="registrarUsuario">
<part name="parameters" element="tns:registrarUsuario"/>
</message>
<message name="registrarUsuarioResponse">
<part name="parameters" element="tns:registrarUsuarioResponse"/>
</message>
<message name="obtenerIdUsuarioPorEmail">
<part name="parameters" element="tns:obtenerIdUsuarioPorEmail"/>
</message>
<message name="obtenerIdUsuarioPorEmailResponse">
<part name="parameters" element="tns:obtenerIdUsuarioPorEmailResponse"/>
</message>
<message name="mostrarBoletosUsuario">
<part name="parameters" element="tns:mostrarBoletosUsuario"/>
</message>
<message name="mostrarBoletosUsuarioResponse">
<part name="parameters" element="tns:mostrarBoletosUsuarioResponse"/>
</message>
<portType name="WSVuelo">
=======
<portType name="WSVuelo">
<operation name="buscarVuelos">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/buscarVuelosRequest" message="tns:buscarVuelos"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/buscarVuelosResponse" message="tns:buscarVuelosResponse"/>
</operation>
<operation name="comprarBoletos">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/comprarBoletosRequest" message="tns:comprarBoletos"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/comprarBoletosResponse" message="tns:comprarBoletosResponse"/>
</operation>
<operation name="mostrarTodosVuelos">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/mostrarTodosVuelosRequest" message="tns:mostrarTodosVuelos"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/mostrarTodosVuelosResponse" message="tns:mostrarTodosVuelosResponse"/>
</operation>
<operation name="registrarUsuario">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/registrarUsuarioRequest" message="tns:registrarUsuario"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/registrarUsuarioResponse" message="tns:registrarUsuarioResponse"/>
</operation>
<operation name="mostrarBoletosUsuario">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/mostrarBoletosUsuarioRequest" message="tns:mostrarBoletosUsuario"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/mostrarBoletosUsuarioResponse" message="tns:mostrarBoletosUsuarioResponse"/>
</operation>
<operation name="obtenerIdUsuarioPorEmail">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/obtenerIdUsuarioPorEmailRequest" message="tns:obtenerIdUsuarioPorEmail"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/obtenerIdUsuarioPorEmailResponse" message="tns:obtenerIdUsuarioPorEmailResponse"/>
</operation>
>>>>>>> 47a79e34fec662558b14e38ab589974b0a06d8e4:01. RESERVA_VUELO_SOAP_JAVA/02. CLICON/vuelos_consola/src/META-INF/wsdl/192.168.0.102_8080/Reservas_vuelos/WSVuelo.wsdl
<operation name="login">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/loginRequest" message="tns:login"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/loginResponse" message="tns:loginResponse"/>
</operation>
<<<<<<< HEAD:01. RESERVA_VUELO_SOAP_JAVA/02. CLIESC/vuelos_escritorio/xml-resources/web-service-references/WSVuelo/wsdl/10.40.26.45_8080/Reservas_vuelos/WSVuelo.wsdl
<operation name="buscarVuelos">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/buscarVuelosRequest" message="tns:buscarVuelos"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/buscarVuelosResponse" message="tns:buscarVuelosResponse"/>
</operation>
<operation name="comprarBoletos">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/comprarBoletosRequest" message="tns:comprarBoletos"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/comprarBoletosResponse" message="tns:comprarBoletosResponse"/>
</operation>
<operation name="mostrarTodosVuelos">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/mostrarTodosVuelosRequest" message="tns:mostrarTodosVuelos"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/mostrarTodosVuelosResponse" message="tns:mostrarTodosVuelosResponse"/>
</operation>
<operation name="registrarUsuario">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/registrarUsuarioRequest" message="tns:registrarUsuario"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/registrarUsuarioResponse" message="tns:registrarUsuarioResponse"/>
</operation>
<operation name="obtenerIdUsuarioPorEmail">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/obtenerIdUsuarioPorEmailRequest" message="tns:obtenerIdUsuarioPorEmail"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/obtenerIdUsuarioPorEmailResponse" message="tns:obtenerIdUsuarioPorEmailResponse"/>
</operation>
<operation name="mostrarBoletosUsuario">
<input wsam:Action="http://controller.monster.edu.ec/WSVuelo/mostrarBoletosUsuarioRequest" message="tns:mostrarBoletosUsuario"/>
<output wsam:Action="http://controller.monster.edu.ec/WSVuelo/mostrarBoletosUsuarioResponse" message="tns:mostrarBoletosUsuarioResponse"/>
</operation>
</portType>
<binding name="WSVueloPortBinding" type="tns:WSVuelo">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
=======
</portType>
<binding name="WSVueloPortBinding" type="tns:WSVuelo">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="buscarVuelos">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="comprarBoletos">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="mostrarTodosVuelos">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="registrarUsuario">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="mostrarBoletosUsuario">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="obtenerIdUsuarioPorEmail">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
>>>>>>> 47a79e34fec662558b14e38ab589974b0a06d8e4:01. RESERVA_VUELO_SOAP_JAVA/02. CLICON/vuelos_consola/src/META-INF/wsdl/192.168.0.102_8080/Reservas_vuelos/WSVuelo.wsdl
<operation name="login">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<<<<<<< HEAD:01. RESERVA_VUELO_SOAP_JAVA/02. CLIESC/vuelos_escritorio/xml-resources/web-service-references/WSVuelo/wsdl/10.40.26.45_8080/Reservas_vuelos/WSVuelo.wsdl
<operation name="buscarVuelos">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="comprarBoletos">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="mostrarTodosVuelos">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="registrarUsuario">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="obtenerIdUsuarioPorEmail">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="mostrarBoletosUsuario">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
=======
>>>>>>> 47a79e34fec662558b14e38ab589974b0a06d8e4:01. RESERVA_VUELO_SOAP_JAVA/02. CLICON/vuelos_consola/src/META-INF/wsdl/192.168.0.102_8080/Reservas_vuelos/WSVuelo.wsdl
</binding>
<service name="WSVuelo">
<port name="WSVueloPort" binding="tns:WSVueloPortBinding">
<soap:address location="http://10.40.26.45:8080/Reservas_vuelos/WSVuelo"/>
</port>
</service>
</definitions>